In [5]:
import numpy as np
import pandas as pd

In [6]:
df = pd.read_csv('./Advertising.csv')

In [7]:
print(df)

        TV  radio  newspaper  sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

In [8]:
df.head()

      TV  radio  newspaper  sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9

In [9]:
df.tail()

        TV  radio  newspaper  sales
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [10]:
df.columns

Index(['TV', 'radio', 'newspaper', 'sales'], dtype='object')

In [11]:
df.tail(3)

        TV  radio  newspaper  sales
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   radio      200 non-null    float64
 2   newspaper  200 non-null    float64
 3   sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

In [13]:
df.dtypes

TV           float64
radio        float64
newspaper    float64
sales        float64
dtype: object

In [14]:
print(df.isna().sum())

TV           0
radio        0
newspaper    0
sales        0
dtype: int64

In [15]:
df.drop(['radio'], axis=1)

        TV  newspaper  sales
0    230.1       69.2   22.1
1     44.5       45.1   10.4
2     17.2       69.3    9.3
3    151.5       58.5   18.5
4    180.8       58.4   12.9
..     ...        ...    ...
195   38.2       13.8    7.6
196   94.2        8.1    9.7
197  177.0        6.4   12.8
198  283.6       66.2   25.5
199  232.1        8.7   13.4

[200 rows x 3 columns]

In [16]:
df.head(10)

      TV  radio  newspaper  sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9
5    8.7   48.9       75.0    7.2
6   57.5   32.8       23.5   11.8
7  120.2   19.6       11.6   13.2
8    8.6    2.1        1.0    4.8
9  199.8    2.6       21.2   10.6

In [17]:
df = df.assign(sales_increased=df['sales'] * 10)
print(df)

        TV  radio  newspaper  sales  sales_increased
0    230.1   37.8       69.2   22.1            221.0
1     44.5   39.3       45.1   10.4            104.0
2     17.2   45.9       69.3    9.3             93.0
3    151.5   41.3       58.5   18.5            185.0
4    180.8   10.8       58.4   12.9            129.0
..     ...    ...        ...    ...              ...
195   38.2    3.7       13.8    7.6             76.0
196   94.2    4.9        8.1    9.7             97.0
197  177.0    9.3        6.4   12.8            128.0
198  283.6   42.0       66.2   25.5            255.0
199  232.1    8.6        8.7   13.4            134.0

[200 rows x 5 columns]

In [18]:
print(f"Shape = {df.shape}")

Shape = (200, 5)

In [19]:
df.describe()

               TV       radio   newspaper       sales  sales_increased
count  200.000000  200.000000  200.000000  200.000000       200.000000
mean   147.042500   23.264000   30.554000   14.022500       140.225000
std     85.854236   14.846809   21.778621    5.217457        52.174566
min      0.700000    0.000000    0.300000    1.600000        16.000000
25%     74.375000    9.975000   12.750000   10.375000       103.750000
50%    149.750000   22.900000   25.750000   12.900000       129.000000
75%    218.825000   36.525000   45.100000   17.400000       174.000000
max    296.400000   49.600000  114.000000   27.000000       270.000000

In [20]:
df.max()

TV                 296.4
radio               49.6
newspaper          114.0
sales               27.0
sales_increased    270.0
dtype: float64

In [21]:
df.min()

TV                  0.7
radio               0.0
newspaper           0.3
sales               1.6
sales_increased    16.0
dtype: float64

In [22]:
df.mean()

TV                 147.0425
radio               23.2640
newspaper           30.5540
sales               14.0225
sales_increased    140.2250
dtype: float64

In [23]:
df.median()

TV                 149.75
radio               22.90
newspaper           25.75
sales               12.90
sales_increased    129.00
dtype: float64

In [25]:
df.std()

TV                 85.854236
radio              14.846809
newspaper          21.778621
sales               5.217457
sales_increased    52.174566
dtype: float64